In [13]:
import pandas as pd
from sklearn.preprocessing import OrdinalEncoder

In [14]:
df = pd.read_csv('Encoding Technique in ML model.csv')
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [15]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [18]:
city_list=['Dhaka', 'Ctg', 'Rangpur']

In [19]:
ordinal = OrdinalEncoder(categories=[city_list])
ordinal

OrdinalEncoder(categories=[['Dhaka', 'Ctg', 'Rangpur']])

In [20]:
encoded_values = ordinal.fit_transform(df[['Area']]) #to do work num and feature ,you need to be two dimension
encoded_values

array([[0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.]])

In [22]:
new_area = pd.DataFrame(encoded_values,columns=['Area'])
new_area

   Area
0   0.0
1   1.0
2   2.0
3   0.0
4   2.0
5   0.0
6   1.0

In [23]:
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [26]:
df.Area = new_area

In [27]:
df

   Marketing spend  Administration  Transport  Area       Profit
0        114523.61       136897.80  471784.10   0.0    192261.83
1        162597.70       151377.59  443898.53   1.0    191792.06
2        153441.51       101145.55  407934.54   2.0    191050.39
3        144372.41       118671.85  383199.62   0.0    182901.99
4        142107.34        91391.77  366168.42   2.0    166187.94
5        131876.90        99814.71  362861.36   0.0    158991.12
6        134615.46       147198.87  127716.82   1.0  15612251.00

In [ ]:
#The end of this Technique